Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPE100.PIC
      <edc:SFRDef edc:_addr="0x1F810090" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnnnnnnn----------nnnnn-nnn" edc:cname="IFS5" edc:desc="" edc:impl="0x1ff801f7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0000000000----------00000-000" edc:name="IFS5" edc:nzwidth="32" edc:por="---0000000000----------00000-000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP3IF" edc:desc="" edc:mask="0x1" edc:name="CMP3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP4IF" edc:desc="" edc:mask="0x1" edc:name="CMP4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP5IF" edc:desc="" edc:mask="0x1" edc:name="CMP5IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U6EIF" edc:desc="" edc:mask="0x1" edc:name="U6EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6RXIF" edc:desc="" edc:mask="0x1" edc:name="U6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6TXIF" edc:desc="" edc:mask="0x1" edc:name="U6TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN1IF" edc:desc="" edc:mask="0x1" edc:name="CAN1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2IF" edc:desc="" edc:mask="0x1" edc:name="CAN2IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="I2C3BIF" edc:desc="" edc:mask="0x1" edc:name="I2C3BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIF" edc:desc="" edc:mask="0x1" edc:name="I2C3SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIF" edc:desc="" edc:mask="0x1" edc:name="I2C3MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATAEEIF" edc:desc="" edc:mask="0x1" edc:name="DATAEEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN3IF" edc:desc="" edc:mask="0x1" edc:name="CAN3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN4IF" edc:desc="" edc:mask="0x1" edc:name="CAN4IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100A0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="IFS6" edc:desc="" edc:impl="0xfffffffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu00uu0000000u000000000u--" edc:name="IFS6" edc:nzwidth="32" edc:por="xxxxxxxx00xx0000000x000000000x--" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C4BIF" edc:mask="0x1" edc:name="I2C4BIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4SIF" edc:mask="0x1" edc:name="I2C4SIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4MIF" edc:mask="0x1" edc:name="I2C4MIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC10EIF" edc:mask="0x1" edc:name="IC10EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC10IF" edc:mask="0x1" edc:name="IC10IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC10IF" edc:mask="0x1" edc:name="OC10IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11EIF" edc:mask="0x1" edc:name="IC11EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11IF" edc:mask="0x1" edc:name="IC11IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC11IF" edc:mask="0x1" edc:name="OC11IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12EIF" edc:mask="0x1" edc:name="IC12EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12IF" edc:mask="0x1" edc:name="IC12IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC12IF" edc:mask="0x1" edc:name="OC12IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13EIF" edc:mask="0x1" edc:name="IC13EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13IF" edc:mask="0x1" edc:name="IC13IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC13IF" edc:mask="0x1" edc:name="OC13IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14EIF" edc:mask="0x1" edc:name="IC14EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14IF" edc:mask="0x1" edc:name="IC14IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC14IF" edc:mask="0x1" edc:name="OC14IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15EIF" edc:mask="0x1" edc:name="IC15EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15IF" edc:mask="0x1" edc:name="IC15IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC15IF" edc:mask="0x1" edc:name="OC15IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16EIF" edc:mask="0x1" edc:name="IC16EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16IF" edc:mask="0x1" edc:name="IC16IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC16IF" edc:mask="0x1" edc:name="OC16IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIF" edc:mask="0x1" edc:name="SPI3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIF" edc:mask="0x1" edc:name="SPI3RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIF" edc:mask="0x1" edc:name="SPI3TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIF" edc:mask="0x1" edc:name="SPI4EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIF" edc:mask="0x1" edc:name="SPI4RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIF" edc:mask="0x1" edc:name="SPI4TXIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100B0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="nn-------nnn-------------nnnnnnn" edc:cname="IFS7" edc:desc="" edc:impl="0xc070007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-------uuu-------------uuuuuuu" edc:name="IFS7" edc:nzwidth="32" edc:por="xx-------xxx-------------xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI5EIF" edc:mask="0x1" edc:name="SPI5EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIF" edc:mask="0x1" edc:name="SPI5RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIF" edc:mask="0x1" edc:name="SPI5TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI6EIF" edc:mask="0x1" edc:name="SPI6EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIF" edc:mask="0x1" edc:name="SPI6RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI6TXIF" edc:mask="0x1" edc:name="SPI6TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SBIF" edc:mask="0x1" edc:name="SBIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="USB2IF" edc:mask="0x1" edc:name="USB2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC3IF" edc:mask="0x1" edc:name="AD1DC3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC4IF" edc:mask="0x1" edc:name="AD1DC4IF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CPCIF" edc:mask="0x1" edc:name="CPCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDCIF" edc:mask="0x1" edc:name="CFDCIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100C0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC0" edc:desc="" edc:impl="0xcfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="IEC0" edc:nzwidth="32" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIE" edc:desc="" edc:mask="0x1" edc:name="CTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IE" edc:desc="" edc:mask="0x1" edc:name="CS0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IE" edc:desc="" edc:mask="0x1" edc:name="CS1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIE" edc:desc="" edc:mask="0x1" edc:name="IC1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIE" edc:desc="" edc:mask="0x1" edc:name="IC2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIE" edc:desc="" edc:mask="0x1" edc:name="IC3EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIE" edc:desc="" edc:mask="0x1" edc:name="IC4EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5EIE" edc:desc="" edc:mask="0x1" edc:name="IC5EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5IE" edc:desc="" edc:mask="0x1" edc:name="IC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IE" edc:desc="" edc:mask="0x1" edc:name="OC5IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTCCIE" edc:desc="" edc:mask="0x1" edc:name="RTCCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIE" edc:desc="" edc:mask="0x1" edc:name="FCEIE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
