Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPE100.PIC
      <edc:SFRDef edc:_addr="0x1F820C10" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02815_tmr_classb_upb_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TMR7" edc:desc="Timer" edc:grp="TMR7" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TMR7" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR7">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR7" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="TMR7" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820C20" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02815_tmr_classb_upb_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PR7" edc:desc="Timer Period" edc:grp="PR7" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000001111111111111111" edc:name="PR7" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR7">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PR7" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PR7" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F820C30" edc:offset="464"/>
      <edc:SFRDef edc:_addr="0x1F820E00" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02815_tmr_classb_upb_v1.Module" edc:_refcount="7" edc:access="----------------n-n----nnnnnn-n-" edc:cname="T8CON" edc:desc="Timer Configuration" edc:grp="TMR8" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000----u00000-0-" edc:name="T8CON" edc:nzwidth="0x20" edc:por="----------------000----x00000-0-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="Timer Clock Source Select bit" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="External clock from TxCK pin" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Internal peripheral clock" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="32-Bit Timer Mode Select bit" edc:mask="0x1" edc:name="T32" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="32-bit Timer mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="16-bit Timer mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="Timer Input Clock Prescale Select bits" edc:mask="0x7" edc:name="TCKPS" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:desc="1:256 prescale value" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="1:64 prescale value" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="1:32 prescale value" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="1:16 prescale value" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="1:8 prescale value" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="1:4 prescale value" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="1:2 prescale value" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="1:1 prescale value" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TGATE" edc:desc="Timer Gated Time Accumulation Enable bit" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Gated time accumulation is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Gated time accumulation is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchronized Timer Start/Stop Enable bit" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Synchronized timer Start/Stop is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Synchronized timer Start/Stop is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="Stop in Idle Mode bit" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Discontinue operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Continue operation even in Idle mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="Timer On bit" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Module is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Module is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER8" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820E10" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02815_tmr_classb_upb_v1.Module" edc:_refcount="7" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TMR8" edc:desc="Timer" edc:grp="TMR8" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TMR8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR8">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR8" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="TMR8" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
