Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPE100.PIC
      <edc:SFRDef edc:_addr="0x1F880740" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="---------------------------rrrrr" edc:cname="C1FIFOCI15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOCI15" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CFIFOCI" edc:desc="" edc:mask="0x1f" edc:name="CFIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F880750" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880760" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880770" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880780" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880790" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8807A0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8807B0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8807C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8807D0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8807E0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8807F0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880800" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880810" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880820" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880830" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880840" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880850" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880860" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880870" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880880" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880890" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8808A0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8808B0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8808C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8808D0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8808E0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8808F0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880900" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880910" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880920" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880930" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880940" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880950" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880960" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880970" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880980" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880990" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8809A0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8809B0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8809C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8809D0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8809E0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8809F0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A00" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A10" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A20" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A30" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A40" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A50" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A60" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A70" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A80" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880A90" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880AA0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880AB0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880AC0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880AD0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880AE0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880AF0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880B00" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880B10" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880B20" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880B30" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880B40" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F880B50" edc:offset="1200"/>
      <edc:SFRDef edc:_addr="0x1F881000" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="2" edc:access="----snnnrrrn----n-n-r------nnnnn" edc:cname="C2CON" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----01001000----0-0-0------00000" edc:name="C2CON" edc:nzwidth="0x20" edc:por="----01001000----0-0-0------00000" edc:portals="CLR SET INV" ltx:baseofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CANBUSY" edc:desc="" edc:mask="0x1" edc:name="CANBUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CANCAP" edc:desc="" edc:mask="0x1" edc:name="CANCAP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="" edc:mask="0x7" edc:name="OPMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CAN2" edc:pos="14"/>
      </edc:SFRDef>
