Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPE100.PIC
      <edc:SFRDef edc:_addr="0x1F881060" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="2" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="C2RXOVF" edc:desc="" edc:grp="CAN1" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="C2RXOVF" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXOVF" edc:desc="" edc:mask="0xffff" edc:name="RXOVF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="RXOVF0" edc:desc="" edc:mask="0x1" edc:name="RXOVF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF1" edc:desc="" edc:mask="0x1" edc:name="RXOVF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF2" edc:desc="" edc:mask="0x1" edc:name="RXOVF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF3" edc:desc="" edc:mask="0x1" edc:name="RXOVF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF4" edc:desc="" edc:mask="0x1" edc:name="RXOVF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF5" edc:desc="" edc:mask="0x1" edc:name="RXOVF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF6" edc:desc="" edc:mask="0x1" edc:name="RXOVF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF7" edc:desc="" edc:mask="0x1" edc:name="RXOVF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF8" edc:desc="" edc:mask="0x1" edc:name="RXOVF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF9" edc:desc="" edc:mask="0x1" edc:name="RXOVF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF10" edc:desc="" edc:mask="0x1" edc:name="RXOVF10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF11" edc:desc="" edc:mask="0x1" edc:name="RXOVF11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF12" edc:desc="" edc:mask="0x1" edc:name="RXOVF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF13" edc:desc="" edc:mask="0x1" edc:name="RXOVF13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF14" edc:desc="" edc:mask="0x1" edc:name="RXOVF14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF15" edc:desc="" edc:mask="0x1" edc:name="RXOVF15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881070" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C2TMR" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C2TMR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CANTSPRE" edc:desc="" edc:mask="0xffff" edc:name="CANTSPRE" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CANTS" edc:desc="" edc:mask="0xffff" edc:name="CANTS" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881080" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C2RXM0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C2RXM0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881090" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C2RXM1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C2RXM1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
