Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPE100.PIC
      <edc:SFRDef edc:_addr="0x1F885220" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C4RXF14" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C4RXF14" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885230" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C4RXF15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C4RXF15" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F885240" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F885250" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F885260" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F885270" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F885280" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F885290" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8852A0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8852B0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8852C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8852D0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8852E0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8852F0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F885300" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F885310" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F885320" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F885330" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F885340" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnrr" edc:cname="C4FIFOBA" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C4FIFOBA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FIFOBA" edc:desc="" edc:islanghidden="true" edc:mask="0x3fffffff" edc:name="FIFOBA" edc:nzwidth="0x1e"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885350" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:access="-----------nnnnn-nnn----nnnnnnnn" edc:cname="C4FIFOCON0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C4FIFOCON0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXPRI" edc:desc="" edc:mask="0x3" edc:name="TXPRI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABAT" edc:desc="" edc:mask="0x1" edc:name="TXABAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DONLY" edc:desc="" edc:mask="0x1" edc:name="DONLY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:desc="" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:desc="" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:desc="" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885360" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:access="-----nnn----nnnn-----rrr----nrrr" edc:cname="C4FIFOINT0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C4FIFOINT0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXNEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIF" edc:desc="" edc:mask="0x1" edc:name="RXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIF" edc:desc="" edc:mask="0x1" edc:name="RXFULLIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIF" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIF" edc:desc="" edc:mask="0x1" edc:name="TXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIF" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RXNEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIE" edc:desc="" edc:mask="0x1" edc:name="RXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIE" edc:desc="" edc:mask="0x1" edc:name="RXFULLIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIE" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIE" edc:desc="" edc:mask="0x1" edc:name="TXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIE" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885370" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr--" edc:cname="C4FIFOUA0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuu00" edc:name="C4FIFOUA0" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:desc="" edc:islanghidden="true" edc:mask="0x3fffffff" edc:name="FIFOUA" edc:nzwidth="0x1e"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
